tutorials/combustion/PDRFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    outer
    {
        type            patch;
        nFaces          825;
        startFace       23340;
    }
    ground
    {
        type            wall;
        nFaces          645;
        startFace       24165;
    }
    blockedFaces
    {
        type            wall;
        nFaces          0;
        startFace       24810;
    }
    baffleWall
    {
        type            wall;
        nFaces          0;
        startFace       24810;
    }
    baffleCyclic_half0
    {
        type            cyclic;
        nFaces          0;
        startFace       24810;
        neighbourPatch  baffleCyclic_half1;
    }
    baffleCyclic_half1
    {
        type            cyclic;
        nFaces          0;
        startFace       24810;
        neighbourPatch  baffleCyclic_half0;
    }
)

// ************************************************************************* //
